src/toir_cf/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КодТехнологическойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/торо_ИдентификаторыТехКарт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 

#Область ОбработчикиСобытий

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
    МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВерсииТехКарт.ТехКарта
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
		|ГДЕ
		|	торо_ВерсииТехКарт.ИдентификаторТехКарты = &ИдентификаторТехКарты";
					   
		Запрос.УстановитьПараметр("ИдентификаторТехКарты", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТехКартаОбъект = Выборка.ТехКарта.ПолучитьОбъект();
			ТехКартаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			ТехКартаОбъект.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		торо_МТОСервер.ПоместитьРемонтыВРегистрДляПроверкиАктуальности(Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция выполняет проверку на использование ремонта
//	в вышестоящих ремонтах.
//
// Параметры:
//	ТекЭлемент - текущий элемент справочника
//	ЭлементПоиска - элемент для сравнения.
//
// Возвращаемое значение:
//	Истина - есть зацикливание, Ложь - нет.
//
Функция ЕстьЗацикливаниеРемонтов(ТекЭлемент, ЭлементПоиска) Экспорт
	
	Если ТипЗнч(ТекЭлемент)<> Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") ИЛИ
		ТипЗнч(ТекЭлемент)=Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И ЭлементПоиска.Пустая() И Не ЗначениеЗаполнено(ТекЭлемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураВозврата = Новый Соответствие;
	
	Если ТекЭлемент = ЭлементПоиска Тогда
		СтруктураВозврата.Вставить(ТекЭлемент.Наименование, ЭлементПоиска.Наименование);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ВерсияТК = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(ТекЭлемент);
	
	Если ЗначениеЗаполнено(ВерсияТК) Тогда
		
		Для Каждого СтрокаОпераций Из ВерсияТК.СписокОпераций Цикл
			
			Если ТипЗнч(СтрокаОпераций.Операция)<> Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаОпераций.Операция = ЭлементПоиска Тогда
				
				СтруктураВозврата.Вставить(ЭлементПоиска.Наименование, ТекЭлемент.Наименование);
				Возврат СтруктураВозврата;
				
			Иначе 
				
				Возврат ЕстьЗацикливаниеРемонтов(СтрокаОпераций.Операция, ЭлементПоиска);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецЕсли
